1-键盘接入两个值，打印比较大的值

2-键盘介入三个值，并按照从大到小依次打印

   


4-判断一个年份是不是闰年
润年：能被4整除但不能被100整除   或者被400整除


5-体质指数（BMI）=体重（kg）÷身高^2（m）

偏瘦  <= 18.4
正常  18.5 ~ 23.9
过重  24.0 ~ 27.9
肥胖  >= 28.0
现要求输入体重和身高，求出体质指数所在范围

6-输入一个数，判断是奇数还是偶数


1.编写一个程序块，从emp表中显示名为“SMITH”的雇员的薪水和职位



2.编写一个程序块，接受用户输入一个部门号，从dept表中显示该部门的名称与所在位置

3.编写一个程序块，利用%type属性，接受一个雇员号，从emp表中显示该雇员的整体薪水(即，薪水加佣金)

4.编写一个程序块，利用%rowtype属性，接受一个雇员号，从emp表中显示该雇员的整体薪水




5.某公司要根据雇员的职位来加薪，公司决定按下列加薪结构处理：
   Designation      Raise
   ------------     --------
   clerk            500
   salesman         1000
   analyst          1500
   otherwise        2000
编写一个程序块，接受一个雇员名，从emp表中实现上述加薪处理





13.编程序求满足不等式 1+3^2+5^2+…+N^2>2000的最小N值。









14.将雇员表中的所有工资小于3000增加400，统计出增加工资的人数及增加的工资数量。

15.从雇员表中显示工资最高的前五个人的姓名，部门和工资。




6.编写一个程序块，将emp表中雇员名全部显示出来


7.编写一个程序块，将emp表中前5人的名字显示出来


8.接受两个数相除并且显示结果，如果第二个数为0，则显示消息“除数不能为0”

9、计算下面级数当末项小于0.001时的部分和。 
1/(1*2)+1/(2*3)+1/(3*4)+…+1/(n*(n+1))+ ……



10、计算s=1*2+2*3+…+N*(N+1),当N=50的值。

11.编写一个PL/SQL程序块，从emp表中对名字以“A”或"S"开始的所有雇员按他们基本薪水的10%给他们加薪


12、两重循环，计算S=1!+2!+…+10!。


   
   